{
  "architectures": [
    "ErnieForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "fuse": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "社交",
    "1": "办公",
    "2": "生活",
    "3": "出行",
    "4": "游戏",
    "5": "音乐",
    "6": "视频",
    "7": "安全隐私",
    "8": "影像",
    "9": "健康",
    "10": "学习",
    "11": "基础",
    "12": "新机",
    "13": "换机",
    "14": "升级",
    "15": "其他"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "健康": 9,
    "其他": 15,
    "出行": 3,
    "办公": 1,
    "升级": 14,
    "基础": 11,
    "学习": 10,
    "安全隐私": 7,
    "影像": 8,
    "换机": 13,
    "新机": 12,
    "游戏": 4,
    "生活": 2,
    "社交": 0,
    "视频": 6,
    "音乐": 5
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "ernie",
  "num_attention_heads": 16,
  "num_hidden_layers": 20,
  "pad_token_id": 0,
  "paddlenlp_version": null,
  "pool_act": "tanh",
  "task_id": 0,
  "task_type_vocab_size": 16,
  "type_vocab_size": 4,
  "use_task_id": true,
  "vocab_size": 40000
}
